discr_for = '''Цикл for или же цикл с параметром. В цикле for указывается переменная и множество значений, по которому будет пробегать переменная. Множество значений может быть задано списком, кортежем, строкой или диапазоном.Цикл For не требует никаких условий, но требует диапозон значений он такой же как while, только с ограничением в кол-во повторений'''
discr_while = '''Цикл while (“пока”) позволяет выполнить одну и ту же последовательность действий, пока проверяемое условие истинно. Условие записывается до тела цикла и проверяется до выполнения тела цикла. Как правило, цикл while используется, когда невозможно определить точное значение количества проходов исполнения цикла.'''
discr_while_example = '''
a=1 
while a < 10:
    print('Цикл выполняется')
    a = a+1
print('Цикл окончен')')'''
faq = '''Здравствуй, пользователь! Этот бот создан для того,чтобы тебе было легче познавать все секреты Python. В этом боте ты сможешь получить информацию о изменяемых и неизменяемых типах данных, узнать разницу между циклами For и While, изучить различные виды модулей, которые встроены в Python и научиться пользоваться различными типами функций.Но наиболее важной частью нашего бота является возможность практиковаться решать задачи,сразу после освоения теории.А для Вашего удобства у каждой задачи предусмотрена возможность увидеть её решение. Кроме всего выше перечисленного, мы решили помочь вам в трудоустройстве, и для этого взяли с сайта hh.ru три уровня квалификации на вашу вакансию. Удачи, программист!!!'''

discr_str = 'Строка — это некоторая последовательность символов, взятая в ковычки. В языке Python строковые данные имеют формат str.'
discr_int = '''int: представляет целое число. В зависимости от архитектуры процессора может занимать 2 байта (16 бит) или 4 байта (32 бита).'''
discr_float = '''Float - Этот тип данных представляет числовые значения, которые могут быть нецелыми. Обычно плавающие значения представляются с округлением.Тип float в Python означает число с плавающей точкой. Значения float определяются с десятичной точкой.'''
discr_set = '''Множество (set) — неупорядоченная коллекция, хранящая набор уникальных значений и поддерживающая для них операции добавления, удаления и определения вхождения.'''
discr_tuple = '''Кортежи (tuple) в Python – это те же списки за одним исключением. Кортежи неизменяемые структуры данных. Так же как списки они могут состоять из элементов разных типов, перечисленных через запятую. Кортежи заключаются в круглые, а не квадратные скобки.'''
discr_list = '''Список (list) представляет тип данных, который хранит набор или последовательность элементов. Списки представляют собой изменяемые последовательности.'''
discr_dict = '''Cловари (тип dict ) представляют собой еще одну разновидность структур данных наряду со списками и кортежами. Словарь - это изменяемый (как список) неупорядоченный (в отличие от строк, списков и кортежей) набор элементов "ключ:значение".'''